# coding: utf-8

#ChatBotの台本

#相槌
response = ["そうですね", "そのようですね"]
#挨拶
greeting = ["おはようございます", "こんにちは", "こんばんは"]
#感謝
thanks = ["ありがとうございます", "助かります"]
#天気
weather = ["日焼けしそうです", "傘が必要かもしれませんね", "薄着でいいかもしれません", "いっぱい着ていったほうがよさそうですね", "折りたたみがさを用意しておいた方がいいです", "外に出たくないですね", "おでかけ日和です"]
sunny = ["日焼けしそうです", "おでかけ日和ですね"]
cloudy = ["折りたたみ傘を用意しておいた方がいいです", "過ごしやすそうです", "折りたたみ傘があると安心ですね"]
rainy = ["傘が必要ですね", "外に出たくないですね"]
typhoon = ["なるべく屋内で過ごしてくださいね", "怪我には気をつけてくださいね"]
#体調
physical_condition = ["私は元気ですよ", "私はいつでも元気ですよ", "絶好調です！"]
#時間
time = ["午前", "午後", "朝", "昼", "夜", "深夜", "夕方", "明け方"]
#同意
agreement = ["そうですね", "私もそう思います", "同意見です"]
#返事
response2 = ["本当です", "はい", "もちろんです"]
#料理
food = ["カレー", "カツ丼", "ラーメン", "親子丼", "焼きそば", "焼き肉", "キムチ鍋", "海鮮丼", "オムライス"]
#誘導
inducement = []
#命令
command = []
#頼む
ask = ["お願いします"]
#趣味
hobby  =["読書", "アニメ鑑賞", "スポーツ", "お絵描き"]
#お世辞・社交辞令
compliment = ["大人っぽいですね"]
#初対面
first_meeting = ["はじめまして"]
#カジュアル
casual = []
#買い物
shopping = []
#恋愛
love = ["好きです"]
#好き
like = ["好きです", "得意です", "大好物です"]
#嫌い
dislike = ["嫌いです", "苦手です"]
#ことわざ
proverv = []
#電話
telephone = ["もしもし"]
#仕事
work = []
#体
body = []
#健康
health = []
#感情
emotion = ["嬉しいです", "楽しいです", "悲しいです", "焦っています", "怒っています"]
#感覚
feeling = ["眠いです", "面倒くさいです", "痛いです", "痒いです"]
#怒る
anger = []
#褒める
commend = ["すごいですね"]
#励ます
encourage = ["頑張ってください", "大丈夫です", "なんとかなりますよ"]
#言い訳
excuse = []
#意見
opinion = []
#注意する
warn = []
#エンターテイメント
entertainment = []
#IT
information_technology = []
#専門
special = []
#学校
school = []
#社会
society = []
#会社
company = []
#スポーツ
sports = ["テニス", "サッカー", "野球", "水泳", "陸上"]
#フォーマル
formal = []
#企画
plan = []
#招待
invitation = []
#アドバイス
advice = []
#法律
law = []
#説明
explanation = []
#説得
persuasion = []
#疑う・疑問
doubt = ["本当ですか", "怪しいです"]
#接客
reception = ["いらっしゃいませ"]
#スラング
slang = []
#旅行
travel = []
#ニュース
news = []
#テレビ・ラジオ
television = []
#音楽
music = []
#勉強
study = []
#ゲーム
game = []
#携帯
smartphone = []
#約束
appointment = []
#地理
geography = []
#気温
temperature = []
#嘘
lie = []
#マニアック
maniac = []
#アニメ
animation = []
#本
book = []
#冗談
joke = []
