# coding: utf-8

# 語彙リスト
vocabulary = ["晴れ", "曇り", "雨", "雷", "雪", "台風", "霧", "午前", "午後", "朝", "昼", "夜", "深夜", "夕", "明け方", "時間", "時計", "天気", "面白い", "映画", "了解", "いつ", "お金", "説明", "来週", "昨日", "一昨日", "明日", "明後日", "今晩", "今朝", "朝食", "昼食", "晩飯", "夜食", "間食", "おやつ", "得意", "苦手", "勉強", "メモリ", "会社", "企業", "学校", "友人", "恋人", "コード", "プログラム", "ネット", "機会", "理解", "判断", "紹介", "登場", "レストラン", "机", "椅子", "ベッド", "自由", "暇", "休み", "名前", "声", "音", "体重", "身長", "空", "花", "植物", "動物", "意味", "内容", "人間", "男性", "女性", "宇宙", "星", "パソコン", "ボット", "分類", "エンジニア", "技術", "頭", "首", "胸", "お腹", "腕", "肘", "足", "膝", "手首", "足首", "太もも", "顔", "食事", "ご飯", "ランチ", "ディナー", "本", "図", "絵", "イラスト", "デザイン", "画像", "地図", "図形", "情報", "ニュース", "データ", "知らせ", "通報", "案内", "予告", "助言", "消息", "便り", "書類", "資料", "文書", "簡単", "単純", "仕事"]

adjective = ["素晴らしい", "良い", "痛い", "気持ちいい", "楽しい", "好き", "嫌い", "美しい", "嬉しい", "悲しい", "寂しい", "つらい", "きつい", "痛い", "眠い", "面倒くさい", "高い", "低い", "安い", "重い", "軽い", "長い", "短い", "暑い", "熱い", "厚い", "寒い", "冷たい", "薄い", "新しい", "古い", "眩しい", "明るい", "暗い", "難しい", "優しい", "忙しい", "早い", "速い", "遅い", "かわいい", "かっこ良い", "綺麗", "きれい", "正しい", "凄い", "甘い", "苦い", "渋い", "酸っぱい", "強い", "弱い", "賢い"]

# 類義語DBにない単語
null_word = ["かっこいい", "すっぱい", "めんどい", "BOT", "メンツ", "はやい"]